app/Http/Controllers/Roles/Admin.php

select * from `users` where `users`.`id` = 1 limit 1
---
    public function index(){
        $id = Auth::User()->id;
        $user = User::find($id);

update `email_checks` set `check` = 0 where `id` = 1
---
public function check(){



    $id = 1;
    $data = array();

    $data['check'] = 0;

DB::table('email_checks')->where('id', $id)->update($data);

update `email_checks` set `check` = 1 where `id` = 1
---
public function updateCheck(){
    $id = 1;
    $data = array();

    $data['check'] = 1;

DB::table('email_checks')->where('id', $id)->update($data);