app/Http/Controllers/Roles/Requester.php

    public function index(){

        $id = Auth::User()->id;
        $user = User::find($id);
---
select * from `users` where `users`.`id` = 2 limit 1

public function allServices(){
    $user= Auth::User()->id;
    $services= ReqServices::latest()->get();
    $requests= Requests::latest()->where('user_id',$user)->get();
    $prov = DB::table('users')->first();


    $orders= Hire::latest()->where('user_id',$user)->get();
---
select * from `req_services` order by `created_at` desc
select * from `requests` where `user_id` = 2 order by `created_at` desc
select * from `users` limit 1
select * from `hires` where `user_id` = 2 order by `created_at` desc

 public function reqPage(){
    $id = Auth::User()->id;
        $user = User::find($id);
        $status = ReqStatus::find(1);
        $services = ReqServices::orderBy('id','ASC')->get();
---
select * from `users` where `users`.`id` = 2 limit 1
select * from `req_statuses` where `req_statuses`.`id` = 1 limit 1
select * from `req_services` order by `id` asc

public function addOrder($id){
    $provid = $id;
    $reqid = Auth::User()->id;
    $user = User::find($reqid);
    $status = ReqStatus::find(1);
    $services = ReqServices::orderBy('id','ASC')->get();
---
select * from `users` where `users`.`id` = 2 limit 1
select * from `req_statuses` where `req_statuses`.`id` = 1 limit 1
select * from `req_services` order by `id` asc